// src/data/vocabulary.js

// Ключевые знаки по тональностям
export const keySignatures = {
  "C-dur": "0",
  "G-dur": "1♯",
  "D-dur": "2♯",
  "A-dur": "3♯",
  "E-dur": "4♯",
  "B-dur": "5♯",
  "F#-dur": "6♯",
  "C#-dur": "7♯",
  "Cb-dur": "7♭",
  "Gb-dur": "6♭",
  "Db-dur": "5♭",
  "Ab-dur": "4♭",
  "Eb-dur": "3♭",
  "Bb-dur": "2♭",
  "F-dur": "1♭",
  
  "A-moll": "0",
  "E-moll": "1♯",
  "B-moll": "2♯",
  "F#-moll": "3♯",
  "C#-moll": "4♯",
  "G#-moll": "5♯",
  "Eb-moll": "6♭",
  "Bb-moll": "5♭",
  "F-moll": "4♭",
  "C-moll": "3♭",
  "G-moll": "2♭",
  "D-moll": "1♭"
};

// Пары параллельных тональностей
export const keyPairs = [
  ["C-dur", "A-moll"],
  ["G-dur", "E-moll"],
  ["D-dur", "B-moll"],
  ["A-dur", "F#-moll"],
  ["E-dur", "C#-moll"],
  ["B-dur", "G#-moll"],
  ["F#-dur", "D#-moll"],
  ["C#-dur", "A#-moll"],
  ["Cb-dur", "Ab-moll"],
  ["Gb-dur", "Eb-moll"],
  ["Db-dur", "Bb-moll"],
  ["Ab-dur", "F-moll"],
  ["Eb-dur", "C-moll"],
  ["Bb-dur", "G-moll"],
  ["F-dur", "D-moll"]
];

// Аккорды в каждой тональности
export const allChords = {
  // Мажоры
  "C-dur": ["C", "Dm", "Em", "F", "G", "Am", "B°"],
  "G-dur": ["G", "Am", "Bm", "C", "D", "Em", "F#°"],
  "D-dur": ["D", "Em", "F#m", "G", "A", "Bm", "C#°"],
  "A-dur": ["A", "Bm", "C#m", "D", "E", "F#m", "G#°"],
  "E-dur": ["E", "F#m", "G#m", "A", "B", "C#m", "D#°"],
  "B-dur": ["B", "C#m", "D#m", "E", "F#", "G#m", "A#°"],
  "F#-dur": ["F#", "G#m", "A#m", "B", "C#", "D#m", "E#°"],
  "C#-dur": ["C#", "D#m", "E#m", "F#", "G#", "A#m", "B#°"],
  "Cb-dur": ["Cb", "Dbm", "Ebm", "Fb", "Gb", "Abm", "Bb°"],
  "Gb-dur": ["Gb", "Abm", "Bbm", "Cb", "Db", "Ebm", "F°"],
  "Db-dur": ["Db", "Ebm", "Fm", "Gb", "Ab", "Bbm", "C°"],
  "Ab-dur": ["Ab", "Bbm", "Cm", "Db", "Eb", "Fm", "G°"],
  "Eb-dur": ["Eb", "Fm", "Gm", "Ab", "Bb", "Cm", "D°"],
  "Bb-dur": ["Bb", "Cm", "Dm", "Eb", "F", "Gm", "A°"],
  "F-dur": ["F", "Gm", "Am", "Bb", "C", "Dm", "E°"],

  // Миноры
  "A-moll": ["Am", "B°", "C", "Dm", "Em", "F", "G"],
  "E-moll": ["Em", "F#°", "G", "Am", "Bm", "C", "D"],
  "B-moll": ["Bm", "C#°", "D", "Em", "F#m", "G", "A"],
  "F#-moll": ["F#m", "G#°", "A", "Bm", "C#m", "D", "E"],
  "C#-moll": ["C#m", "D#°", "E", "F#m", "G#m", "A", "B"],
  "G#-moll": ["G#m", "A#°", "B", "C#m", "D#m", "E", "F#"],
  "Ab-moll": ["Abm", "Bb°", "Cb", "Dbm", "Ebm", "Fb", "Gb"],
  "Eb-moll": ["Eb", "F°", "Gb", "Ab", "Bb", "Cm", "D"],
  "Bb-moll": ["Bb", "C°", "Db", "Eb", "Fm", "G", "Ab"],
  "F-moll": ["Fm", "G°", "Ab", "Bbm", "Cm", "D", "Eb"],
  "C-moll": ["Cm", "D°", "Eb", "Fm", "Gm", "Ab", "Bb"],
  "G-moll": ["Gm", "A°", "Bb", "Cm", "Dm", "Eb", "F"],
  "D-moll": ["Dm", "E°", "F", "Gm", "Am", "Bb", "C"],
  "D#-moll": ["D#m", "E#°", "F#", "G#m", "A#m", "Bb", "C#"],
  "A#-moll": ["A#m", "B#°", "C#", "D#m", "E#m", "F#", "G#"]
};

// Табулатуры (аппликатуры) для гитары
export const chordDiagrams = {
  // Мажорные аккорды
  "C": ["x-3-2-0-1-0", "8-10-10-9-8-8"],
  "D": ["x-x-0-2-3-2", "x-5-4-2-3-2", "x-5-7-7-7-5", "10-12-12-11-10-10"],
  "E": ["0-2-2-1-0-0", "0-x-2-4-5-4", "x-7-9-9-9-7", "0-X-9-11-12-11", "12-14-14-13-12-12"],
  "F": ["1-3-3-2-1-1", "x-x-3-2-1-1", "x-x-3-5-6-5", "x-8-10-10-10-8"],
  "G": ["3-2-0-0-0-3", "3-2-0-0-3-3", "3-5-5-4-3-3", "x-x-5-7-8-7"],
  "A": ["x-0-2-2-2-0", "5-7-7-6-5-5", "x-0-2-2-0-0"],
  "B": ["x-2-4-4-4-2", "7-9-9-8-7-7"],

  // Альтерированные мажоры (диезы)
  "F#": ["2-4-4-3-2-2", "x-x-4-6-7-6", "x-9-11-11-11-9"],
  "C#": ["x-4-3-1-2-1", "x-4-6-6-6-x", "9-11-11-10-9-9"],
  "G#": ["4-6-6-5-4-4", "x-x-6-9-10-9", "x-11-13-13-13-11"],
  "A#": ["x-1-3-3-3-1", "x-x-3-5-6-5", "6-8-8-7-6-6", "x-x-8-10-11-10"], // ~=Bb

  // Мажоры с бемолями
  "Cb": ["x-2-4-4-4-x", "7-9-9-8-7-7"],
  "Db": ["x-4-6-6-6-4", "9-11-11-11-9-9", "x-2-4-4-4-x"], // C#
  "Eb": ["x-6-8-8-8-6", "x-6-5-3-4-3"],
  "Fb": ["0-2-2-1-0-0", "x-7-9-9-9-7", "12-14-14-13-12-12"],
  "Gb": ["2-4-4-3-2-2"], // F#
  "Ab": ["4-6-6-5-4-4", "x-x-6-5-7-5"], // G#
  "Bb": ["x-1-3-3-3-1", "6-8-8-7-6-6"], // ~=A#

  // Минорные аккорды
  "Cm": ["x-3-5-5-4-3", "8-10-10-8-8"],
  "Dm": ["x-x-0-2-3-1", "x-5-7-7-6-5", "x-5-3-2-x-x", "x-5-3-x-3-5"],
  "Em": ["0-2-2-0-0-0", "0-x-2-4-3-5", "x-7-9-9-8-7", "x-X-9-11-10-12"],
  "Fm": ["1-3-3-1-1-1", "x-8-10-10-9-8", "x-x-10-12-11-13"],
  "Gm": ["3-1-0-3-3-x", "3-5-5-3-3-3", "x-x-5-7-6-8"],
  "Am": ["x-0-2-2-1-0", "5-7-7-5-5-5"],
  "Bm": ["x-2-4-4-3-2", "7-9-9-7-7-7", "x-2-4-4-3-2", "x-x-9-11-9-12", "x-x-9-11-0-12"],

  // Альтерированные миноры (диезы)
  "E#m": ["1-3-3-1-1-1", "x-x-3-5-4-6", "x-7-9-9-8-7"],
  "F#m": ["2-4-4-2-2-2", "x-9-11-11-10-9"],
  "C#m": ["x-4-6-6-5-4", "9-11-11-9-9-9"],
  "Dbm": ["x-4-6-6-5-4", "9-11-11-9-9-9"],
  "Ebm": ["x-x-1-3-2-4", "x-6-8-8-7-6"],
  "Bbm": ["x-1-3-3-2-1", "6-8-8-6-6-6", "x-x-8-10-9-11"],

  // Миноры с бемолями
  "G#m": ["4-6-6-4-4-4", "x-11-13-13-12-11"],
  "A#m": ["x-1-3-3-2-1", "6-8-8-6-6-6"], // Энгармонизм Bbm
  "D#m": ["x-x-1-3-2-4", "x-6-8-8-7-8"], // Энгармонизм Ebm

  // Энгармонизмы миноров
  "Abm": ["4-6-6-4-4-4", "x-x-6-8-7-9"], // G#m

  // Уменьшенные септаккорды
  "C°": ["x-3-1-2-1-x"],
  "D°": ["x-5-6-5-6-x"],
  "E°": ["0-7-6-7-x-x"],
  "F°": [
      "x-x-3-1-2-1",  // Вариант 1
      "x-8-7-6-8-x", // Вариант 2
      "1-2-3-1-x-x" // Вариант 3
  ],
  "G°": ["3-x-6-5-6-x"],
  "A°": ["5-x-6-5-6-x"],
  "B°": ["x-2-3-2-3-x"],
  "A#°": ["x-1-2-1-2-1"],
  "C#°": ["x-4-5-4-5-x"],
  "F#°": ["x-8-9-8-9-x"],
  "G#°": ["4-x-6-5-6-x"],
  "B#°": ["x-3-2-0-1-0"],

  // Энгармонические варианты уменьшенных аккордов
  "Ab°": ["4-x-6-5-6-x"],
  "Bb°": ["x-1-2-1-2-1"],
  "Db°": ["x-4-5-4-5-x"],
  "Eb°": ["x-6-7-6-7-x"],
  "E#°": ["1-2-3-1-1-1", "x-8-9-10-9-x"],
  "D#°": ["x-6-7-6-7-x"]
};